app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Hi there"], ["created_at", Mon, 09 Jul 2012 09:55:17 UTC +00:00], ["updated_at", Mon, 09 Jul 2012 09:55:17 UTC +00:00]]
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save